<<<<<<< HEAD

=======
[Last 15 Minutes of IP Address]
search = index=homemonitor sourcetype=fios process=OUT | timechart count(process) by dest_ip usenull=false, useother=false

[Top 10 Remote IP's by Duration in Minutes]
search = index=homemonitor sourcetype=fios NOT remote_ip=192.168.1.0/24 NOT remote_ip=127.0.0.1| transaction remote_ip, remote_port, dest_ip, dest_port | stats sum(duration) as sum by remote_ip | eval "Total in Minutes" = sum/360 | sort -"Total in Minutes" |table remote_ip "Total in Minutes" | head 10

[Duration by Remote IP - last 60 minutes]
search = index=homemonitor sourcetype=fios NOT remote_ip=127.0.0.1 | transaction src_ip, src_port, remote_ip, remote_port | timechart count(duration) by remote_ip usenull=false, useother=false

[In vs. Out bound traffic broken down by Country (Last 60 minutes)]
search = index=homemonitor sourcetype=fios connection_state="Connection closed" OR connection_state="Connection open" | geoip remote_ip  | timechart per_hour(eval(process="IN")) AS IN, per_hour(eval(process="OUT")) AS OUT, by remote_ip_country_name usenull=false, useother=false
[Sendmail transactions]
action.email.reportServerEnabled = 0
alert.track = 0
vsid = *:mdqkbg27

[Last 60 Minutes In Bound Ports by number of IP's]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = sample_search
request.ui_dispatch_view = sample_search
search = index=homemonitor sourcetype=fios NOT src_ip=192.168.1.0/24 process="IN" | stats count(src_ip) as Count by traffic_ports | sort - Count
vsid = h6jtomen

[Clients Accessing Ports (Total Count)]
action.email.reportServerEnabled = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = sample_search
request.ui_dispatch_view = sample_search
search = index=homemonitor sourcetype=fios NOT src_ip=192.168.1.0/24 process="IN" TCP | stats count, values(src_ip) as Clients by traffic_ports | table Clients traffic_ports count | sort - count
vsid = h6jwp0d4

[Last 7 days traffic Accept vs. Blocks]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor sourcetype=fios process="IN" | stats count(process) by action
vsid = h73smtna

[Top Port Requests (Out Bound) Last 60 Minutes]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor sourcetype=fios process="OUT" | top limit=50 traffic_ports
vsid = h73tafxe

[Realtime IN Bound TCP Traffic (30 Minute)]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = rt-30m
dispatch.latest_time = rt
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor sourcetype=fios process="IN" transport="TCP" | stats count(process) as hits
vsid = h73tepaw

[Realtime OUT Bound TCP Traffic (30 Minute)]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = rt-30m
dispatch.latest_time = rt
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor sourcetype=fios process="OUT" transport="TCP" | stats count(process) as hits
vsid = h73tg7qr

[Last 15 minutes of Remote IP]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -15m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype=not-local-maps-view process="IN" remote| timechart count(process) by src_ip
vsid = h6i5gnir

[Last 60 Minutes In Bound IP's by number of Ports Accessing]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = sample_search
request.ui_dispatch_view = sample_search
search = eventtype=not-local-maps-view process="IN" | stats count(traffic_ports) as Count by src_ip | sort - Count
vsid = h6jtgxra

[Last 60 Minutes In Bound IP's by number of Ports Accessing Table]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = sample_search
request.ui_dispatch_view = sample_search
search = eventtype=not-local-maps-view process="IN" TCP | stats count, values(traffic_ports) as Ports by src_ip | table src_ip Ports count | sort - count
vsid = h6jwsqbf

[Top Blocked Countries in the last 4 Hours]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -4h@h
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor action="BLOCK" NOT src_ip=192.168* | geoip src_ip | stats count(action) by src_ip_country_name
vsid = h7bbzyzk

[Last 7 days Top In Bound Connections by City]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -7d
dispatch.latest_time = now
displayview = sample_search
request.ui_dispatch_view = sample_search
search = index=homemonitor process="IN" NOT src_ip=192.168.* |  geoip src_ip | stats sparkline count(src_ip) as Count by src_ip_city | sort - Count
vsid = h6i779a5

[Last 7 days Top In Bound Connections by Country]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -7d
dispatch.latest_time = now
displayview = sample_search
request.ui_dispatch_view = sample_search
search = index=homemonitor process="IN" NOT src_ip=192.168.* |  geoip src_ip | stats sparkline count(src_ip) as Count by src_ip_country_name | sort - Count
vsid = h6i795mx

[Last 60 Minutes IP's Going to Ports Total Count]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = sample_search
request.ui_dispatch_view = sample_search
search = index=homemonitor NOT src_ip=192.168* process="IN" TCP | stats count, values(src_port) as Ports by src_ip | table src_ip Ports count | sort - count
vsid = h6jwrqtu

[Top Port Requests (In Bound) Last 60 Minutes]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor process="IN" | top limit=50 src_port
vsid = h73t90f9

[Traffic by Day of the Week]
action.email.inline = 1
action.email.reportServerEnabled = 0
action.summary_index = 1
action.summary_index._name = homemonitor
alert.suppress = 0
alert.track = 1
cron_schedule = 0 0 * * *
description = Traffic by Day of the Week
dispatch.earliest_time = -7d
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
search = index=homemonitor process="in" | timechart count(process) by date_wday
vsid = *:ana4wosj

[Last 15 Minutes of IP Address]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
description = Last 15 Minutes of Out Bound IP's
dispatch.earliest_time = -15m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor process="OUT" | timechart count(process) by dest_ip
vsid = h6i5c3sv

[Duration by Source Port IN Bound]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor | transaction src_ip, src_port, remote_ip, remote_port | timechart count(duration) by src_port
vsid = hak82e94

[Duration by Remote IP - last 60 minutes]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor | transaction src_ip, src_port, remote_ip, remote_port | timechart count(duration) by remote_ip
vsid = hak7z0b5

[Top 8 Cities last 30 minutes real time]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = rt-30m
dispatch.latest_time = rt
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor | geoip remote_ip | top 8 remote_ip_city
vsid = hak9t0w5

[Top 10 Remote IP's by Duration in Minutes]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = -60m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor | transaction src_ip, src_port, remote_ip, remote_port | stats sum(duration) as sum by remote_ip | eval "Total in Minutes" = sum/360 | sort -"Total in Minutes" |table remote_ip "Total in Minutes" | head 10
vsid = hal4096o

[Top 10 Port requests by Duration in Minutes]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = -60m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor | transaction src_ip, src_port, remote_ip, remote_port | stats sum(duration) as sum by src_port | eval "Total in Minutes" = sum/360 | sort -"Total in Minutes" | table src_port "Total in Minutes" | head 10
vsid = hal4417u

[Top 10 Root ports]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor src_port<=1024 | transaction src_ip, src_port, remote_ip, remote_port | timechart count(duration) by src_port | head 10
vsid = hal49f4b

[Top 10 Non-Root ports]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = -60m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor src_port>=1024 | transaction src_ip, src_port, remote_ip, remote_port | timechart count(duration) by src_port | head 10
vsid = hal48f29

[Top Blocked IP's]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = -4h@h
dispatch.latest_time = now
displayview = hm_search
request.ui_dispatch_view = hm_search
search = index=homemonitor action="BLOCK" NOT src_ip=192.168* | top limit=10000 src_ip
vsid = h73tku62

[Realtime Transport Traffic by IP's]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = -15m@m
dispatch.latest_time = now
displayview = hm_search
request.ui_dispatch_view = hm_search
search = index=homemonitor | stats count(src_ip) by transport
vsid = h73gyiy9

[Exploitable Ports Time Chart (Last 24 Hours)]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize = 1
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
displayview = hm_search
request.ui_dispatch_view = hm_search
search = index=homemonitor sourcetype="syslog" src_port=22 OR src_port=21 OR src_port=3389 OR src_port=3306 OR src_port=23 OR src_port=1521 OR src_port=1433 OR src_port=445 OR src_port=8090 OR src_port=2479 OR 1080 | geoip src_ip | timechart count by src_port
vsid = han6xzkb

[Source Country by Port]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor NOT src_ip=192.168.1.0/8 AND NOT remote_ip=192.168.1.0/8 process=IN | geoip src_ip | timechart span=5m count(src_ip_country_name) by src_port
vsid = hb86cly0

[Source Ports by Country]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -24h@m
dispatch.latest_time = now
displayview = hm_search
request.ui_dispatch_view = hm_search
search = index=homemonitor NOT src_ip=192.168.1.0/8 AND NOT remote_ip=192.168.1.0/8 process=IN | geoip src_ip | timechart span=5m count(src_port) by src_ip_country_name
vsid = hb860a7i

[Last 60 Minutes In vs. Out Traffic]
action.email.reportServerEnabled = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor | timechart per_hour(eval(process="IN")) AS IN, per_hour(eval(process="OUT")) AS OUT
vsid = hc148uam

[Real Time (30 Minute Window) In vs. Out bound traffic]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
cron_schedule = * * * * *
dispatch.earliest_time = rt-60m
dispatch.latest_time = rt
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor connection_state="Connection closed" OR connection_state="Connection open"| timechart per_hour(eval(process="IN")) AS IN, per_hour(eval(process="OUT")) AS OUT
vsid = hc20zyey

[Chatty Clients Last 15 minutes]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize = 1
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -60m
dispatch.latest_time = now
displayview = hm_search
request.ui_dispatch_view = hm_search
search = index=homemonitor process="OUT" src_ip=192.168.1.0/8 connection_state="Connection closed" OR connection_state="Connection open" | timechart count(process) by src_ip
vsid = hc254twg

[In vs. Out bound traffic broken down by transport (Last 60 minutes)]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize = 1
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor connection_state="Connection closed" OR connection_state="Connection open" | timechart per_hour(eval(process="IN")) AS IN, per_hour(eval(process="OUT")) AS OUT, by transport
vsid = hc29bssy

[In vs. Out bound traffic broken down by Country (Last 60 minutes)]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize = 1
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor connection_state="Connection closed" OR connection_state="Connection open" | geoip remote_ip  | timechart per_hour(eval(process="IN")) AS IN, per_hour(eval(process="OUT")) AS OUT, by remote_ip_country_name
vsid = hc29noxu

[Connection States Last 24 Hours]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
auto_summarize = 1
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor | top connection_state
vsid = hc2b3mkp

[Non Connection based router messages]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
auto_summarize = 1
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor NOT connection_state="Connection *" | top limit=10000 connection_state
vsid = hc2b759n

[Connection State break down last 24 hours]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
auto_summarize = 1
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor NOT connection_state="Connection*" | stats count values(dest_ip) as "Destination IP", values(src_ip) as "Source IP", values(remote_ip) as "Remote IP", by connection_state | table connection_state "Destination IP" "Source IP" "Remote IP" count | sort -count
vsid = hc2btbzl

[Real Time (30 Minute Window) Configuration Changes]
action.email.reportServerEnabled = 0
alert.track = 0
dispatch.earliest_time = rt-30m
dispatch.latest_time = rt
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = connection_state="Configuration change" NOT Unknown | stats count(connection_state)
vsid = hc2c7x58

[Number of Configuration Changes to Router]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
cron_schedule = * * * * *
dispatch.earliest_time = rt-30m
dispatch.latest_time = rt
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = connection_state="Configuration change" NOT Unknown | stats count(connection_state)
vsid = hc2c1561

[Number of Configuration Changes to Router Last 30 Days]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
auto_summarize = 1
auto_summarize.dispatch.earliest_time = -1mon@d
auto_summarize.timespan = 1m
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = connection_state="Configuration change" NOT Unknown | stats count(connection_state)
vsid = hc2clqe1

[Configuration Changes to Router]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = * * * * *
dispatch.earliest_time = rt-30m
dispatch.latest_time = rt
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = connection_state="Configuration change" NOT Unknown | stats count values(connection_state) as Connections, by config_change_user
vsid = hc2bz3p0

[Real Time Accept vs. Block Last 60 Minute]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = rt-1h
dispatch.latest_time = rt
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor | timechart per_hour(eval(action="BLOCK")) AS BLOCK, per_hour(eval(action="ACCEPT")) AS ACCEPT
vsid = hc2dvnhv

[Number of Configuration Changes to Router Last 7 Days]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize = 1
auto_summarize.dispatch.earliest_time = -7d@d
auto_summarize.timespan = 1m
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = connection_state="Configuration change" NOT Unknown | stats count(connection_state)
vsid = hc2ckwfi

[Configuration Changes to Router by user Last 30 Days]
action.email.reportServerEnabled = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = connection_state="Configuration change" NOT Unknown | stats count values(connection_state) as Connections, by config_change_user
vsid = hg3sjils

[Configuration Changes to Router by user Last 7 Days]
action.email.reportServerEnabled = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = connection_state="Configuration change" NOT Unknown | stats count values(connection_state) as Connections, by config_change_user
vsid = hg3sksnb
>>>>>>> FETCH_HEAD
