[Sendmail transactions]
action.email.reportServerEnabled = 0
alert.track = 0
vsid = *:mdqkbg27

[Last 60 Minutes In Bound Ports by number of IP's]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = sample_search
request.ui_dispatch_view = sample_search
search = index=homemonitor NOT client_ip=192.168* process="IN" | stats count(client_ip) as Count by traffic_ports | sort - Count
vsid = h6jtomen

[Clients Accessing Ports (Total Count)]
action.email.reportServerEnabled = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = sample_search
request.ui_dispatch_view = sample_search
search = index=homemonitor NOT client_ip=192.168* process="IN" TCP | stats count, values(client_ip) as Clients by traffic_ports | table Clients traffic_ports count | sort - count
vsid = h6jwp0d4

[Last 7 days traffic Accept vs. Blocks]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor process="IN" | stats count(process) by action
vsid = h73smtna

[Top Port Requests (Out Bound) Last 60 Minutes]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor process="OUT" | top limit=50 traffic_ports
vsid = h73tafxe

[Realtime IN Bound TCP Traffic (30 Minute)]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = rt-30m
dispatch.latest_time = rt
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor process="IN" transport="TCP" | stats count(process) as hits
vsid = h73tepaw

[Realtime OUT Bound TCP Traffic (30 Minute)]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = rt-30m
dispatch.latest_time = rt
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor process="OUT" transport="TCP" | stats count(process) as hits
vsid = h73tg7qr

[SSH Attempt]
action.email = 1
action.email.format = csv
action.email.reportServerEnabled = 0
action.email.sendresults = 1
action.email.to = kamir78@verizon.net
alert.digest_mode = 0
alert.suppress = 0
alert.suppress.period = 30s
alert.track = 0
cron_schedule = * * * * *
dispatch.earliest_time = rt
dispatch.latest_time = rt
displayview = hm_search
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_view = hm_search
search = index=homemonitor traffic_ports=22
vsid = h77plmwh

[Last 15 minutes of Remote IP]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -15m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype=not-local-maps-view process="IN" remote| timechart count(process) by client_ip
vsid = h6i5gnir

[Last 60 Minutes In Bound IP's by number of Ports Accessing]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = sample_search
request.ui_dispatch_view = sample_search
search = eventtype=not-local-maps-view process="IN" | stats count(traffic_ports) as Count by client_ip | sort - Count
vsid = h6jtgxra

[Last 60 Minutes In Bound IP's by number of Ports Accessing Table]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = sample_search
request.ui_dispatch_view = sample_search
search = eventtype=not-local-maps-view process="IN" TCP | stats count, values(traffic_ports) as Ports by client_ip | table client_ip Ports count | sort - count
vsid = h6jwsqbf

[Top Blocked Countries in the last 4 Hours]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -4h@h
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor action="BLOCK" NOT client_ip=192.168* | geoip client_ip | stats count(action) by client_ip_country_name
vsid = h7bbzyzk

[Last 7 days Top In Bound Connections by City]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -7d
dispatch.latest_time = now
displayview = sample_search
request.ui_dispatch_view = sample_search
search = index=homemonitor process="IN" NOT client_ip=192.168.* |  geoip client_ip | stats sparkline count(client_ip) as Count by client_ip_city | sort - Count
vsid = h6i779a5

[Last 7 days Top In Bound Connections by Country]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -7d
dispatch.latest_time = now
displayview = sample_search
request.ui_dispatch_view = sample_search
search = index=homemonitor process="IN" NOT client_ip=192.168.* |  geoip client_ip | stats sparkline count(client_ip) as Count by client_ip_country_name | sort - Count
vsid = h6i795mx

[Last 60 Minutes IP's Going to Ports Total Count]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = sample_search
request.ui_dispatch_view = sample_search
search = index=homemonitor NOT client_ip=192.168* process="IN" TCP | stats count, values(src_port) as Ports by client_ip | table client_ip Ports count | sort - count
vsid = h6jwrqtu

[Top Port Requests (In Bound) Last 60 Minutes]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor process="IN" | top limit=50 src_port
vsid = h73t90f9

[Traffic by Day of the Week]
action.email.inline = 1
action.email.reportServerEnabled = 0
action.summary_index = 1
action.summary_index._name = homemonitor
alert.suppress = 0
alert.track = 1
cron_schedule = 0 0 * * *
description = Traffic by Day of the Week
dispatch.earliest_time = -7d
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
search = index=homemonitor process="in" | timechart count(process) by date_wday
vsid = *:ana4wosj

[Last 15 Minutes of IP Address]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
description = Last 15 Minutes of Out Bound IP's
dispatch.earliest_time = -15m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor process="OUT" | timechart count(process) by dest_ip
vsid = h6i5c3sv

[Duration by Source Port IN Bound]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor | transaction src_ip, src_port, remote_ip, remote_port | timechart count(duration) by src_port
vsid = hak82e94

[Duration by Remote IP - last 60 minutes]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor | transaction src_ip, src_port, remote_ip, remote_port | timechart count(duration) by remote_ip
vsid = hak7z0b5

[Top 8 Cities last 30 minutes real time]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = rt-30m
dispatch.latest_time = rt
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor | geoip remote_ip | top 8 remote_ip_city
vsid = hak9t0w5

[Top 10 Remote IP's by Duration in Minutes]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = -60m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor | transaction src_ip, src_port, remote_ip, remote_port | stats sum(duration) as sum by remote_ip | eval "Total in Minutes" = sum/360 | sort -"Total in Minutes" |table remote_ip "Total in Minutes" | head 10
vsid = hal4096o

[Top 10 Port requests by Duration in Minutes]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = -60m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor | transaction src_ip, src_port, remote_ip, remote_port | stats sum(duration) as sum by src_port | eval "Total in Minutes" = sum/360 | sort -"Total in Minutes" | table src_port "Total in Minutes" | head 10
vsid = hal4417u

[Top 10 Root ports]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor src_port<=1024 | transaction src_ip, src_port, remote_ip, remote_port | timechart count(duration) by src_port | head 10
vsid = hal49f4b

[Top 10 Non-Root ports]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = -60m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=homemonitor src_port>=1024 | transaction src_ip, src_port, remote_ip, remote_port | timechart count(duration) by src_port | head 10
vsid = hal48f29

[Top Blocked IP's]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = -4h@h
dispatch.latest_time = now
displayview = hm_search
request.ui_dispatch_view = hm_search
search = index=homemonitor action="BLOCK" NOT src_ip=192.168* | top limit=10000 src_ip
vsid = h73tku62

[Realtime Transport Traffic by IP's]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = -15m@m
dispatch.latest_time = now
displayview = hm_search
request.ui_dispatch_view = hm_search
search = index=homemonitor | stats count(src_ip) by transport
vsid = h73gyiy9

[Exploitable Ports Time Chart (Last 24 Hours)]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
auto_summarize = 1
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
displayview = hm_search
request.ui_dispatch_view = hm_search
search = index=homemonitor sourcetype="syslog" src_port=22 OR src_port=21 OR src_port=3389 OR src_port=3306 OR src_port=23 OR src_port=1521 OR src_port=8080 | geoip src_ip | timechart count by src_port
vsid = han6xzkb
